## SQL Basics Assignment

Q1.Create a table called employees with the following structure:

 .emp_id (integer, should not be NULL and should be a primary key)
 
 .emp_name (text, should not be NULL)
 
 .age (integer, should have a check constraint to ensure the age is at least 18)
 
 .email (text, should be unique for each employee)
 
 .salary (decimal, with a default value of 30,000).
 
 .Write the SQL query to create the above table with all constraints

Ans. CREATE TABLE employees (

    emp_id INTEGER NOT NULL PRIMARY KEY,
    emp_name TEXT NOT NULL,
    age INTEGER CHECK (age >= 18),
    email TEXT UNIQUE,
    salary DECIMAL DEFAULT 30000
);

Q2.Explain the purpose of constraints and how they help maintain data integrity in a database. Provide 
examples of common types of constraints.

Ans. Constraints are rules enforced on data in a database to ensure accuracy, consistency, and reliability. They help maintain data integrity by restricting the type of data that can be entered into tables. Constraints prevent invalid data entry and ensure relationships between tables are preserved.

Types of Data Integrity Ensured by Constraints:

1. Entity Integrity: Ensures unique identification of records, typically through primary keys.

2. Domain Integrity: Ensures data falls within a valid range or set of values.


3. Referential Integrity: Maintains consistent relationships between tables.

4. User-Defined Integrity: Enforces business-specific rules.


Benefits of Constraints:

1. Enforce Data Accuracy: Constraints prevent invalid data, ensuring higher quality.

Example: A CHECK constraint ensures a valid range of data, such as price > 0.

2. Ensure Consistency: Constraints like FOREIGN KEY maintain relationships between tables.

Example: A FOREIGN KEY ensures an order references a valid customer.

3. Simplify Maintenance: Built-in rules reduce the need for custom application logic for data validation.

Example: NOT NULL prevents missing required information.

Q3.Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justify 
your answer.

Ans. The NOT NULL constraint ensures that a column cannot have NULL values. This is applied to maintain entity integrity and to ensure that every record has meaningful and complete data in that column.

No, a primary key cannot contain NULL values. This is because a primary key uniquely identifies each record in a table, and NULL represents an unknown or undefined value, which violates the purpose of uniqueness and identification.

Justification:
Uniqueness Requirement: Each record must be uniquely identifiable, and allowing NULL would mean the key is ambiguous or partially missing.

Example: If emp_id (primary key) is NULL for two employees, they cannot be uniquely identified.
Entity Integrity Rule: The primary key is essential for the entity integrity of the database. NULL would disrupt the integrity since it doesn't represent a valid or usable value for identification.

SQL Standard: By definition, a primary key enforces NOT NULL and UNIQUE constraints. This means that SQL does not allow a primary key to contain NULL.

Q4. Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an 
example for both adding and removing a constraint.

Ans. Steps to Add a Constraint

1. Determine the Type of Constraint: Decide which type of constraint (NOT NULL, UNIQUE, CHECK, PRIMARY KEY, FOREIGN KEY, etc.) needs to be added.

2. Check Existing Data: Ensure that the existing data in the table satisfies the new constraint. If it doesnâ€™t, update the data to comply with the constraint.

3. Use ALTER TABLE: Use the ALTER TABLE command to add the constraint.


Example: Add a CHECK Constraint

Suppose you have an employees table, and you want to ensure that the salary column is always greater than or equal to 30,000.

ALTER TABLE employees
ADD CONSTRAINT chk_salary CHECK (salary >= 30000);


Steps to Remove a Constraint

1. Identify the Constraint Name: Each constraint has a unique name, either explicitly defined during creation or system-generated. Use the database system catalogs (e.g., information_schema in PostgreSQL) to find the constraint name if not known.

2. Use ALTER TABLE: Use the ALTER TABLE command with DROP CONSTRAINT to remove the constraint.


Example: Remove the CHECK Constraint

To remove the chk_salary constraint from the employees table:

ALTER TABLE employees
DROP CONSTRAINT chk_salary;

Q5. Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints. 
Provide an example of an error message that might occur when violating a constraint.

Ans. Consequences of Violating Constraints in a Database

When attempting to insert, update, or delete data in a way that violates constraints, the database system will reject the operation and return an error. This prevents the database from containing invalid, inconsistent, or incomplete data, thereby maintaining data integrity.

Common Scenarios of Constraint Violations and Consequences

1. Violating a NOT NULL Constraint

Scenario: Attempting to insert or update a column that has a NOT NULL constraint with a NULL value.
Consequence: The operation fails because the column cannot have NULL.

2. Violating a UNIQUE Constraint

Scenario: Attempting to insert a duplicate value into a column with a UNIQUE constraint.
Consequence: The operation is rejected to prevent duplicate entries.

3. Violating a CHECK Constraint

Scenario: Attempting to insert or update a value that fails the CHECK condition.
Consequence: The database blocks the operation.

Consequences Summary

1. Immediate Rejection of the Query:
The database does not execute the operation.

2. Error Messages:
The database system generates error messages indicating the type of constraint violated and the specific data causing the issue.

3. Data Integrity Preserved:
The database remains in a consistent and valid state.


Example Scenario

Table Definition:

CREATE TABLE employees (

    emp_id INTEGER PRIMARY KEY,
    emp_name TEXT NOT NULL,
    email TEXT UNIQUE,
    age INTEGER CHECK (age >= 18)
);

Q6. You created a products table without constraints as follows:

 CREATE TABLE products (
 
 product_id INT,
 
 product_name VARCHAR(50),
 
 price DECIMAL(10, 2));
 
 Now, you realise that
 
 The product_id should be a primary key
 
 The price should have a default value of 50.00

Ans. 
To modify the products table and add the required constraints, you can use the ALTER TABLE command. Hereâ€™s how to do it:

Steps to Add the Constraints :

1. Add the Primary Key Constraint to product_id: Ensure the product_id column is unique and non-NULL to satisfy the requirements of a primary key.

2. Add the Default Value Constraint to price: Ensure that the price column has a default value of 50.00.


SQL Commands to Add Constraints

1. Add Primary Key Constraint to product_id:

ALTER TABLE products

ADD CONSTRAINT pk_product_id PRIMARY KEY (product_id);

2. Add Default Value for price:

ALTER TABLE products

ALTER COLUMN price SET DEFAULT 50.00;

Q7. <img src = 'Q7.png' style = "width:800px; height:800px">

Ans. 
   SELECT 
   
    Students.student_name, 
    
    Classes.class_name
    
FROM 

    Students
    
INNER JOIN 

    Classes
    
ON 
    Students.class_id = Classes.class_id;

Q8. <img src = "Q8.png">

Ans. 

SELECT 

    Orders.order_id, 
    
    Customers.customer_name, 
    
    Products.product_name
    
FROM 

    Products
    
LEFT JOIN 

    Orders
    
ON 
    Products.order_id = Orders.order_id
    
LEFT JOIN 

    Customers
ON 
    Orders.customer_id = Customers.customer_id;

Q9. <img src = "Q9.png">

Ans. 
  SELECT 
  
    p.product_name,
    
    SUM(s.amount) AS total_sales
    
FROM 

    Sales s
    
INNER JOIN 

    Products p
    
ON 

    s.product_id = p.product_id
    
GROUP BY 

    p.product_name;

Q10 <img src = "Q10.png">

Ans. 
   
   SELECT 
   
    o.order_id,
    
    c.customer_name,
    
    od.quantity
    
FROM 

    Orders o
    
INNER JOIN 

    Customers c
    
ON

    o.customer_id = c.customer_id
    
INNER JOIN 

    Order_Details od
    
ON 

    o.order_id = od.order_id;

## SQL Commands

Q1-Identify the primary keys and foreign keys in maven movies db. Discuss the differences

Ans.

1. actor Table:

Primary Key: actor_id

2. film Table:

Primary Key: film_id

3. film_actor Table:

Primary Key: Composite key (actor_id, film_id)

Foreign Keys:

actor_id references actor(actor_id)

film_id references film(film_id)

4. category Table:

Primary Key: category_id

5. film_category Table:

Primary Key: Composite key (film_id, category_id)

Foreign Keys:

film_id references film(film_id)

category_id references category(category_id)

6. customer Table:

Primary Key: customer_id

Foreign Key: store_id references store(store_id)

7. store Table:

Primary Key: store_id

Foreign Key: manager_staff_id references staff(staff_id)

8. staff Table:

Primary Key: staff_id

Foreign Key: store_id references store(store_id)

9. rental Table:

Primary Key: rental_id

Foreign Keys:

inventory_id references inventory(inventory_id)

customer_id references customer(customer_id)

staff_id references staff(staff_id)

10. inventory Table:

Primary Key: inventory_id

Foreign Keys:

film_id references film(film_id)

store_id references store(store_id)

11. payment Table:

Primary Key: payment_id

Foreign Keys:

customer_id references customer(customer_id)

staff_id references staff(staff_id)

rental_id references rental(rental_id)

12. address Table:

Primary Key: address_id

Foreign Key: city_id references city(city_id)

13. city Table:

Primary Key: city_id

Foreign Key: country_id references country(country_id)

14. country Table:

Primary Key: country_id

15. language Table:

Primary Key: language_id

16. film_text Table:

Primary Key: film_id

Differences Between Primary and Foreign Keys:

Primary Key:

1. Uniquely identifies each record in a table.

2. Cannot contain NULL values.

3. Each table can have only one primary key, which may consist of single or multiple columns (composite key).

Foreign Key:

1. Establishes a link between records in two tables.

2. Can contain NULL values unless specified otherwise.

3. A table can have multiple foreign keys, each linking to a primary key in another table.

These keys are fundamental in maintaining the relational integrity of the Maven Movies database, ensuring that relationships between tables are consistent and that data remains accurate.

Q2- List all details of actors

Ans.The query will retrieve all rows and columns from the actor table, which might include columns like:

actor_id (Primary Key)

first_name

last_name

last_update (or other metadata, depending on the schema)

Q3-List all customer information from DB.

Ans. 
To list all customer information from the Maven Movies database, use the following SQL query:

customer_id (Primary Key)

first_name

last_name

email

address_id (Foreign Key to the address table)

active (Indicating if the customer is active)

create_date

last_update

Q4 -List different countries.

Ans. SELECT DISTINCT country FROM country;

Q5 -Display all active customers.

Ans. SELECT * 
FROM customer 
WHERE active = 1;

Q6. List of all rental IDs for customer with ID 1.

Ans. 
SELECT rental_id

FROM rental

WHERE customer_id = 1;

Q7 Display all the films whose rental duration is greater than 5 .

Ans.
SELECT title

FROM film

WHERE rental_duration > 5;

In [1]:
#Q8  List the total number of films whose replacement cost is greater than $15  and less than  $20.

Ans. 
SELECT COUNT(*) AS total_films

FROM film

WHERE replacement_cost > 15 AND replacement_cost < 20;

Q9 Display the count of unique first names of actors.

Ans. 

SELECT COUNT(DISTINCT first_name) AS unique_first_names

FROM actor;

Q10.  Display the first 10 records from the customer table .

Ans. 
SELECT *

FROM customer

LIMIT 10;

Q11 Display the first 3 records from the customer table whose first name starts with â€˜bâ€™.

Ans. 
SELECT *

FROM customer

WHERE first_name LIKE 'B%'

LIMIT 3;

Q12 Display the names of the first 5 movies which are rated as â€˜Gâ€™.

Ans.
SELECT title

FROM film

WHERE rating = 'G'

LIMIT 5;

Q13 Find all customers whose first name starts with "a".

Ans. 
SELECT * FROM customers

WHERE first_name LIKE 'A%';

Q14 Find all customers whose first name ends with "a".

Ans. 
SELECT * FROM customers

WHERE first_name LIKE '%a';

Q15 Display the list of first 4 cities which start and end with â€˜aâ€™ .

Ans

SELECT city 

FROM cities

WHERE city LIKE 'A%A'

LIMIT 4;

Q16 Find all customers whose first name have "NI" in any position.

Ans 

SELECT * FROM customers

WHERE first_name LIKE '%NI%';

Q17  Find all customers whose first name have "r" in the second position .

Ans

SELECT * FROM customers

WHERE first_name LIKE '_r%';

Q18 Find all customers whose first name starts with "a" and are at least 5 characters in length.

Ans 

SELECT * FROM customers

WHERE first_name LIKE 'A%' 

AND LENGTH(first_name) >= 5;

Q19 Find all customers whose first name starts with "a" and ends with "o".

Ans 

SELECT * FROM customers

WHERE first_name LIKE 'A%o';

Q20 - Get the films with pg and pg-13 rating using IN operator.

Ans. 

SELECT * FROM films

WHERE rating IN ('PG', 'PG-13');

Q21  Get the films with length between 50 to 100 using between operator

Ans 

SELECT * FROM films

WHERE length BETWEEN 50 AND 100;

Q22  Get the top 50 actors using limit operator.

Ans. 

 SELECT * FROM actors
 
LIMIT 50;

Q23 Get the distinct film ids from inventory table.

Ans. 

SELECT DISTINCT film_id

FROM inventory;

## Function  Basic Aggregate Functions:

 Question 1:
 Retrieve the total number of rentals made in the Sakila database.
 Hint: Use the COUNT() function

Ans.   

SELECT COUNT(*) AS total_rentals

FROM rental;

 Question 2:
 Find the average rental duration (in days) of movies rented from the Sakila database.
 Hint: Utilize the AVG() function.

Ans. 

SELECT AVG(rental_duration) AS average_rental_duration

FROM film;

 String Functions:
 Question 3:
 Display the first name and last name of customers in uppercase.
 Hint: Use the UPPER () function.

Ans. 

SELECT UPPER(first_name) AS first_name_upper,

       UPPER(last_name) AS last_name_upper
       
FROM customer;

 Question 4:
 Extract the month from the rental date and display it alongside the rental ID.
 Hint: Employ the MONTH() function.

Ans. 

SELECT rental_id, MONTH(rental_date) AS rental_month

FROM rental;

 GROUP BY:
 
 Question 5:
 Retrieve the count of rentals for each customer (display customer ID and the count of rentals).
 Hint: Use COUNT () in conjunction with GROUP BY

Ans. 

SELECT customer_id, COUNT(*) AS rental_count

FROM rental

GROUP BY customer_id;

 Question 6:
 Find the total revenue generated by each store.
 Hint: Combine SUM() and GROUP BY.

Ans. 

SELECT store_id, SUM(amount) AS total_revenue

FROM payment

GROUP BY store_id;

 Question 7:
 Determine the total number of rentals for each category of movies.
 Hint: JOIN film_category, film, and rental tables, then use COUNT () and GROUP BY.

Ans. 

SELECT c.name AS category_name, COUNT(*) AS rental_count

FROM rental r

JOIN inventory i ON r.inventory_id = i.inventory_id

JOIN film_category fc ON i.film_id = fc.film_id

JOIN category c ON fc.category_id = c.category_id

GROUP BY c.name;

Question 8:
 Find the average rental rate of movies in each language.
 Hint: JOIN film and language tables, then use AVG () and GROUP BY.

Ans. 

SELECT l.name AS language_name, AVG(f.rental_rate) AS average_rental_rate

FROM film f

JOIN language l ON f.language_id = l.language_id

GROUP BY l.name;

## Joins

 Questions 9 -
 Display the title of the movie, customer s first name, and last name who rented it.
 Hint: Use JOIN between the film, inventory, rental, and customer tables.

Ans. 

SELECT f.title AS movie_title, c.first_name, c.last_name

FROM rental r

JOIN inventory i ON r.inventory_id = i.inventory_id

JOIN film f ON i.film_id = f.film_id

JOIN customer c ON r.customer_id = c.customer_id;

 Question 10:
 Retrieve the names of all actors who have appeared in the film "Gone with the Wind."
 Hint: Use JOIN between the film actor, film, and actor tables

Ans.

SELECT a.first_name, a.last_name

FROM actor a

JOIN film_actor fa ON a.actor_id = fa.actor_id

JOIN film f ON fa.film_id = f.film_id

WHERE f.title = 'Gone with the Wind';

 Question 11:
 Retrieve the customer names along with the total amount they've spent on rentals.
 Hint: JOIN customer, payment, and rental tables, then use SUM() and GROUP BY.

Ans. 

SELECT c.first_name, c.last_name, SUM(p.amount) AS total_spent

FROM customer c

JOIN payment p ON c.customer_id = p.customer_id

JOIN rental r ON p.rental_id = r.rental_id

GROUP BY c.customer_id;

 Question 12:
 List the titles of movies rented by each customer in a particular city (e.g., 'London').
 Hint: JOIN customer, address, city, rental, inventory, and film tables, then use GROUP BY.

Ans.

SELECT c.first_name, c.last_name, f.title AS movie_title

FROM customer c

JOIN address a ON c.address_id = a.address_id

JOIN city ci ON a.city_id = ci.city_id

JOIN rental r ON c.customer_id = r.customer_id

JOIN inventory i ON r.inventory_id = i.inventory_id

JOIN film f ON i.film_id = f.film_id

WHERE ci.city = 'London';

##  Advanced Joins and GROUP BY:

 Question 13:
 Display the top 5 rented movies along with the number of times they've been rented.
 Hint: JOIN film, inventory, and rental tables, then use COUNT () and GROUP BY, and limit the results.

Ans. 

SELECT f.title, COUNT(*) AS rental_count

FROM rental r

JOIN inventory i ON r.inventory_id = i.inventory_id

JOIN film f ON i.film_id = f.film_id

GROUP BY f.title

ORDER BY rental_count DESC

LIMIT 5;

 Question 14:
 Determine the customers who have rented movies from both stores (store ID 1 and store ID 2).
 Hint: Use JOINS with rental, inventory, and customer tables and consider COUNT() and GROUP BY.

Ans.

SELECT c.customer_id, c.first_name, c.last_name

FROM rental r

JOIN inventory i ON r.inventory_id = i.inventory_id

JOIN customer c ON r.customer_id = c.customer_id

WHERE i.store_id IN (1, 2)

GROUP BY c.customer_id, c.first_name, c.last_name

HAVING COUNT(DISTINCT i.store_id) = 2;

## Windows Function:

 Q1. Rank the customers based on the total amount they've spent on rentals.

Ans

SELECT 

    customer_id,
    customer_name,
    SUM(amount_spent) AS total_spent,
    RANK() OVER (ORDER BY SUM(amount_spent) DESC) AS rank
    
FROM 

    rentals
    
GROUP BY 

    customer_id, customer_name
    
ORDER BY 

    rank;

Q2 Calculate the cumulative revenue generated by each film over time.

Ans. 

SELECT 

    film_id,
    rental_date,
    rental_amount,
    SUM(rental_amount) OVER (PARTITION BY film_id ORDER BY rental_date) AS cumulative_revenue
    
FROM 

    rentals
    
ORDER BY 

    film_id, rental_date;

 Q3. Determine the average rental duration for each film, considering films with similar lengths.

Ans.

SELECT 

    film_length,
    AVG(rental_duration) AS average_rental_duration
    
FROM 

    films
    
JOIN 

    rentals ON films.film_id = rentals.film_id
    
GROUP BY 

    film_length
    
ORDER BY 

    film_length;

 Q4. Identify the top 3 films in each category based on their rental counts.

Ans. 

WITH RankedFilms AS (

    SELECT 
    
        f.film_id,
        f.title,
        f.category_id,
        c.category_name,
        COUNT(r.rental_id) AS rental_count,
        ROW_NUMBER() OVER (PARTITION BY f.category_id ORDER BY COUNT(r.rental_id) DESC) AS rank
        
    FROM 
    
        films f
        
    JOIN 
    
        rentals r ON f.film_id = r.film_id
    JOIN 
    
        categories c ON f.category_id = c.category_id
        
    GROUP BY 
        f.film_id, f.title, f.category_id, c.category_name
)
SELECT 

    film_id,
    title,
    category_name,
    rental_count
FROM 

    RankedFilms
WHERE 


    rank <= 3
    
ORDER BY 

    category_name, rank;

 Q5. Calculate the difference in rental counts between each customer's total rentals and the average rentals
 across all customers.

Ans.

WITH CustomerRentalCounts AS (

    SELECT 
    
        customer_id,
        COUNT(rental_id) AS total_rentals
        
    FROM 
        rentals
    GROUP BY 
        customer_id
),

AverageRentalCount AS (

    SELECT 
        AVG(total_rentals) AS avg_rentals
    FROM 
        CustomerRentalCounts
)

SELECT 

    c.customer_id,
    c.total_rentals,
    a.avg_rentals,
    c.total_rentals - a.avg_rentals AS rental_difference
    
FROM 

    CustomerRentalCounts c
    
CROSS JOIN 

    AverageRentalCount a
    
ORDER BY 

    rental_difference DESC;

Q6. Find the monthly revenue trend for the entire rental store over time.

Ans. 

SELECT 

    YEAR(rental_date) AS year,
    MONTH(rental_date) AS month,
    SUM(rental_amount) AS total_revenue
    
FROM 

    rentals
    
GROUP BY 

    YEAR(rental_date), MONTH(rental_date)
    
ORDER BY 

    year, month;

 Q7. Identify the customers whose total spending on rentals falls within the top 20% of all customers.

Ans. 

WITH CustomerSpending AS (

    SELECT 
        customer_id,
        SUM(rental_amount) AS total_spent
    FROM 
        rentals
    GROUP BY 
        customer_id
),

CustomerRank AS (

    SELECT 
        customer_id,
        total_spent,
        PERCENT_RANK() OVER (ORDER BY total_spent DESC) AS percentile_rank
    FROM 
        CustomerSpending
)

SELECT 

    customer_id,
    total_spent
FROM 

    CustomerRank
    
WHERE 

    percentile_rank <= 0.2
    
ORDER BY 

    total_spent DESC;

 Q8. Calculate the running total of rentals per category, ordered by rental count.

Ans.

WITH CategoryRentalCounts AS (

    SELECT 
        f.category_id,
        c.category_name,
        COUNT(r.rental_id) AS rental_count
        
    FROM 
        films f
    JOIN 
        rentals r ON f.film_id = r.film_id
    JOIN 
        categories c ON f.category_id = c.category_id
    GROUP BY 
        f.category_id, c.category_name
)

SELECT 

    category_name,
    rental_count,
    SUM(rental_count) OVER (ORDER BY rental_count DESC) AS running_total
    
FROM 

    CategoryRentalCounts
    
ORDER BY 

    rental_count DESC;

 Q9. Find the films that have been rented less than the average rental count for their respective categories.

Ans.

WITH CategoryRentalCounts AS (

    SELECT 
        f.film_id,
        f.title,
        f.category_id,
        c.category_name,
        COUNT(r.rental_id) AS rental_count
        
    FROM 
        films f
    JOIN 
        rentals r ON f.film_id = r.film_id
    JOIN 
        categories c ON f.category_id = c.category_id
    GROUP BY 
        f.film_id, f.title, f.category_id, c.category_name
),

CategoryAvgRentalCount AS (

    SELECT 
        category_id,
        AVG(rental_count) AS avg_rental_count
        
    FROM 
    
        CategoryRentalCounts
    GROUP BY 
        category_id
)

SELECT 

    f.film_id,
    f.title,
    c.category_name,
    r.rental_count,
    a.avg_rental_count
    
FROM 

    CategoryRentalCounts r
JOIN 

    CategoryAvgRentalCount a ON r.category_id = a.category_id
JOIN 

    films f ON r.film_id = f.film_id
WHERE 

    r.rental_count < a.avg_rental_count
ORDER BY 

    r.category_name, r.rental_count;

 Q10. Identify the top 5 months with the highest revenue and display the revenue generated in each month.

Ans.

SELECT 

    YEAR(rental_date) AS year,
    MONTH(rental_date) AS month,
    SUM(rental_amount) AS total_revenue
    
FROM 

    rentals
    
GROUP BY 

    YEAR(rental_date), MONTH(rental_date)
ORDER BY 

    total_revenue DESC
    
LIMIT 5;

## Normalisation & CTE

 1. First Normal Form (1NF):
 a. Identify a table in the Sakila database that violates 1NF. Explain how you would normalize it to achieve 1NF

Ans. In the context of the Sakila database, tables typically violate First Normal Form (1NF) when they contain repeating groups or multiple values in a single column. A good example of this is the film_actor table, which has multiple actors per film. However, this table doesn't violate 1NF in its structure, but we will analyze it for normalization concepts.

A clearer violation can often be seen in the address table when it stores multiple contact numbers or addresses in a single field (if this was the case).

For illustration, let's assume a hypothetical table customer_contact_info that violates 1NF due to multiple phone numbers stored in a single field:

Summary:
The original table violated 1NF because it had a repeating group of values (multiple phone numbers in a single column).
After normalization, the table satisfies 1NF because all columns contain atomic values, and each row is unique based on the combination of customer_id and phone_number.
This is a simple example, but the principle applies to any situation where a column holds multiple values that need to be split into separate rows to achieve 1NF.

 2. Second Normal Form (2NF): a. Choose a table in Sakila and describe how you would determine whether it is in 2NF. 
 If it violates 2NF, explain the steps to normalize it.

Ans. A table is in Second Normal Form (2NF) if:

It is already in First Normal Form (1NF).
It has no partial dependency; that is, no non-key column is dependent on only part of a composite primary key. In other words, if a table has a composite primary key (a key made of more than one column), all non-key columns must depend on the entire key, not just part of it.

The film_actor table, as originally designed, is already in 2NF because it doesn't have non-key attributes, and thus there are no partial dependencies.
A modified version of the table with non-key attributes like actor_name and film_title would violate 2NF because these attributes depend only on part of the composite primary key.
The solution to normalize the table would involve creating separate tables for actors and films, linking them with the film_actor table. This eliminates partial dependencies and ensures the table meets 2NF.

 3. Third Normal Form (3NF): a. Identify a table in Sakila that violates 3NF. Describe the transitive dependencies
present and outline the steps to normalize the table to 3NF.

Ans. A table is in Third Normal Form (3NF) if:

It is in Second Normal Form (2NF).

It has no transitive dependencies, meaning non-key columns should not depend on other non-key columns.

The original customer table violated 3NF due to transitive dependencies: store_name depends on store_id, and address and city depend on address_id.
To normalize to 3NF, we created separate store and address tables, eliminating the transitive dependencies by ensuring that non-key columns are dependent only on the primary key.

 4. Normalization Process:
 a. Take a specific table in Sakila and guide through the process of normalizing it from the initial  
 unnormalized form up to at least 2NF.

Ans. Unnormalized Form (UNF): The initial table contains repeating groups (multiple phone numbers in one column).

1NF: The table is transformed to have atomic values by splitting phone numbers into separate rows.

2NF: The table is normalized by removing partial dependencies (separating the customer details and phone numbers into different tables).

At this point, the table is in 2NF because:

There are no partial dependencies.
Non-key columns are fully dependent on the entire primary key.
This normalization process ensures the database is more efficient and reduces redundancy.

 5. CTE Basics:
 a. Write a query using a CTE to retrieve the distinct list of actor names and the number of films they 
 have acted in from the actor and film_actor tables.

Ans.

WITH ActorFilmCount AS (

    SELECT 
        a.first_name || ' ' || a.last_name AS actor_name,
        COUNT(fa.film_id) AS num_films
    FROM actor a
    JOIN film_actor fa ON a.actor_id = fa.actor_id
    GROUP BY a.actor_id
)

SELECT 

    actor_name,
    num_films
    
FROM ActorFilmCount

ORDER BY num_films DESC;

Q6. CTE with Joins:
a. Create a CTE that combines information from the film and language tables to display the film title, 
language name, and rental rate

Ans. 

WITH FilmLanguageInfo AS (

    SELECT 
        f.title AS film_title,
        l.name AS language_name,
        f.rental_rate
        
    FROM film f
    JOIN language l ON f.language_id = l.language_id
)

SELECT 

    film_title,
    language_name,
    rental_rate
    
FROM FilmLanguageInfo

ORDER BY film_title;

Q7  CTE for Aggregation:
a. Write a query using a CTE to find the total revenue generated by each customer (sum of payments) 
 from the customer and payment tables.

Ans. 

WITH CustomerRevenue AS (

    SELECT 
        c.customer_id,
        c.first_name || ' ' || c.last_name AS customer_name,
        SUM(p.amount) AS total_revenue
    FROM customer c
    JOIN payment p ON c.customer_id = p.customer_id
    GROUP BY c.customer_id
)
SELECT 

    customer_name,
    total_revenue
    
FROM CustomerRevenue

ORDER BY total_revenue DESC;

Q8 CTE with Window Functions:
 a. Utilize a CTE with a window function to rank films based on their rental duration from the film table

Ans. 

WITH FilmRank AS (

    SELECT 
        f.title AS film_title,
        f.rental_duration,
        RANK() OVER (ORDER BY f.rental_duration DESC) AS rental_rank
    FROM film f
)

SELECT 

    film_title,
    rental_duration,
    rental_rank
    
FROM FilmRank

ORDER BY rental_rank;

Q9 CTE and Filtering:
 a. Create a CTE to list customers who have made more than two rentals, and then join this CTE with the 
customer table to retrieve additional customer details.

Ans

WITH CustomerRentals AS (

    SELECT 
        c.customer_id,
        COUNT(r.rental_id) AS rental_count
    FROM customer c
    JOIN rental r ON c.customer_id = r.customer_id
    GROUP BY c.customer_id
    HAVING COUNT(r.rental_id) > 2
)

SELECT 

    c.customer_id,
    c.first_name,
    c.last_name,
    c.email,
    cr.rental_count
    
FROM CustomerRentals cr

JOIN customer c ON cr.customer_id = c.customer_id

ORDER BY cr.rental_count DESC;

Q10 CTE for Date Calculations:
 a. Write a query using a CTE to find the total number of rentals made each month, considering the 
rental_date from the rental table

Ans. 
WITH MonthlyRentals AS (

    SELECT 
        EXTRACT(YEAR FROM r.rental_date) AS rental_year,
        EXTRACT(MONTH FROM r.rental_date) AS rental_month,
        COUNT(r.rental_id) AS total_rentals
    FROM rental r
    GROUP BY rental_year, rental_month
)

SELECT 

    rental_year,
    rental_month,
    total_rentals
    
FROM MonthlyRentals

ORDER BY rental_year, rental_month;

Q11 CTE and Self-Join:
 a. Create a CTE to generate a report showing pairs of actors who have appeared in the same film 
together, using the film_actor table.

Ans.

WITH ActorPairs AS (

    SELECT 
        fa1.actor_id AS actor1_id,
        fa2.actor_id AS actor2_id,
        fa1.film_id
    FROM film_actor fa1
    JOIN film_actor fa2 
        ON fa1.film_id = fa2.film_id 
        AND fa1.actor_id < fa2.actor_id  -- to avoid duplicate pairs
)

SELECT 

    a1.first_name || ' ' || a1.last_name AS actor1_name,
    a2.first_name || ' ' || a2.last_name AS actor2_name,
    ap.film_id
    
FROM ActorPairs ap

JOIN actor a1 ON ap.actor1_id = a1.actor_id

JOIN actor a2 ON ap.actor2_id = a2.actor_id

ORDER BY ap.film_id;

12. CTE for Recursive Search:
 a. Implement a recursive CTE to find all employees in the staff table who report to a specific manager, 
considering the reports_to column

Ans.

WITH RECURSIVE EmployeeHierarchy AS (

    -- Anchor member: Select the manager (for example, manager with staff_id = 1)
    SELECT 
        s.staff_id,
        s.first_name || ' ' || s.last_name AS employee_name,
        s.reports_to
    FROM staff s
    WHERE s.staff_id = 1  -- Replace 1 with the desired manager's staff_id

    UNION ALL

    -- Recursive member: Select employees who report to the employees from the previous step
    SELECT 
        s.staff_id,
        s.first_name || ' ' || s.last_name AS employee_name,
        s.reports_to
    FROM staff s
    INNER JOIN EmployeeHierarchy eh ON s.reports_to = eh.staff_id
)

SELECT 

    staff_id,
    employee_name
    
FROM EmployeeHierarchy


ORDER BY employee_name;